---
kind: enumMember
id: F:Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.InvalidClassificationCode
enum: Autodesk.Revit.DB.KeyBasedTreeEntryErrorType
source: html/92f21b30-036d-9fa8-0662-b5d0e7c474de.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.InvalidClassificationCode

The classification code does not match the level and parent code.